{
  "elements": {
    "nodes": [
      {
        "data": {
          "id": "I.1",
          "label": "atha yogānuśāsanam",
          "Translation_Bryant": "Now, the teachings of yoga [are presented].",
          "Translation_Leggett": "Now the exposition of yoga",
          "Vyasa_commentary": "Commentary (bhāṣyam) - 'Atha' (atha iti), this (word) (ayam) means (arthaḥ) (the beginning of) a topic (adhikāra)| It is to be understood (vediyatavyam) that (this) scripture (śāstram) (dealing with) the instruction (anuśāsanam) regarding Yoga (yoga) (is) the subject (to be studied) (adhikṛtam)| Yoga (yogaḥ) is Samādhi or Perfect Concentration (samādhiḥ)| And (ca) this (Yoga) (saḥ) (is) a quality (dharmaḥ) related to all conditions (sārvabhauma) of the mind (cittasya)| (Those) mental (citta) conditions (bhūmayaḥ) (are the following:) Kṣipta --restless-- (kṣiptam), Mūḍha --stupefied-- (mūḍham), Vikṣipta --distraught-- (vikṣiptam), Ekāgra --one-pointed-- (ekāgram) (and) Niruddha --arrested or suppressed-- (niruddham iti)| In that (tatra) distraught (vikṣipte) mind --cetas-- (cetasi), Samādhi or Perfect Concentration (samādhiḥ) is (bhūtaḥ) subordinated (upasarjanī) to (its) distraction (vikṣepa). (This Samādhi) is not (na... vartate) on the Yoga's (yoga) side (pakṣe) --i.e. it does not belong to Yoga--| However (tu) that (Samādhi) (yaḥ) (occurring) in an one-pointed (ekāgre) mind --cetas-- (cetasi) brings enlightenment (pradyotayati) about a real (sadbhūtam) entity (artham)1  and (ca) destroys (kṣiṇoti) the Kleśa-s or Afflictions (kleśān)2 , loosens (ślathayati) the bonds (bandhāni) of Karma (karma) (and) leads (abhimukham karoti) to the arrested or suppressed state of mind (nirodham). That (Samādhi) (saḥ) is to be called (ākhyāte) Samprajñātayoga (samprajñāto yogaḥ iti)| Besides (ca), that (Samprajñātayoga) (saḥ) concerns (anugataḥ... anugataḥ... anugataḥ... anugataḥ) Vitarka (vitarka), Vicāra (vicāra), Ānanda (ānanda) (and) Asmitā (asmitā... iti) 3 . We will make (this subject) known (pravedayiṣyāmaḥ) later on (upariṣṭāt)| Nevertheless (tu), when all (sarva) (mental) modifications (vṛtti) are suppressed (nirodhe), (that is) Asamprajñātasamādhi (asamprajñātaḥ samādhiḥ)||1||",
          "Sankara_commentary": "(Opponent) If the sūtra has been presented to give this definition, it should have been ‘Yoga has inhibition of the mental processes’; to put them in apposition is not right, for a definition should not be simply the thing defined. Or at any rate it should have been said, ‘The definition is, inhibition of the mental processes.’\n\n(Answer) A definition is projected (adhyas) on to the thing defined. When we say ‘This person is Devadatta’ there is a projection (adhyāsa) of the definition on to the thing defined. So there is no fault.\n\nThe omission of the word All shows that the cognitive (samādhi) too is yoga.\n\n(Opponent) (The commentator’s previous gloss) But the ultra-cognitive is when there is inhibition of all mental processes is also a definition of it, so the sūtra should have been ‘Yoga is inhibition of all mental processes.’ This has not been said and the definition is too wide.\n\n(Answer) As to why the word All is omitted from the sūtra, he says that if All were put in, it would be denying that the cognitive samādhi, which comes about by restricting the processes to a single point, is yoga at all. To prevent that, the word All is left out.\n\n(Opponent) If so, the cognitive and ultra-cognitive have the same definition and are not in fact distinguished.\n\n(Answer) The subject is yoga, as we see from the repetition of the word (in the first two sūtra-s). And unless he did intend a distinction, there would have been no point in putting into the definition the word yoga (which is well known to include meditation on objects).\n\n(Opponent) The word yoga is of minor importance for actual exposition; it would suit the purpose of exposition if the definition just said ‘Inhibition of the mental processes’ without the word yoga at all.\n\n(Answer) Not so, because what was introduced was an exposition of yoga, and it is exposition of yoga that has been begun, not exposition of non-yoga. The proposed definition could have too many contexts and would not be connected to the meaning of the words ‘exposition of yoga’. For the idea of an exposition of yoga does not follow from the words ‘inhibition of mental processes’.\n\n(Opponent) Why then should the word yoga lead to a definition of the ultra-cognitive samādhi alone, and not to a definition of the cognitive, if there is no such distinction in the word itself?\n\n(Answer) Because it applies exactly. What applies loosely is not a definition of a thing. The definition as inhibition applies exactly to the ultra-cognitive samādhi, but only loosely to the cognitive. Having horns is not the mark of cow-ness, because it applies also to buffaloes and other animals.\n\n(Opponent) Neither is inhibition exact as a definition of the ultra-cognitive; (it is too loose) because there is inhibition in the cognitive too, namely inhibition of the undesired mental processes.\n\n(Answer) True, but the ultra-cognitive cannot be defined by anything else except inhibition. Inhibition alone is its definition because nothing else is there, whereas the cognitive is definable in terms of special characteristics like verbal associations. As a parallel case, when tangibility is cited as a defining mark, it is the element Air alone that is defined by the fact of tangibility, which is regarded as special to it, though in fact tangibility is found also in the other elements in the descending order from Fire (to Water and then Earth).\n\nThus the word yoga is simply a corroboration (anuvāda), and so it is that All has not been put in the sūtra. It is settled that the ultra-cognitive is defined by the bare word ‘inhibition’, and if ‘All (the mental processes)’ were included, it would deny that the cognitive also is yoga. Therefore this is the definition of ultra-cognitive alone, and the commentator will sum up later in these words: Ultra-cognitive (a-sam-prajñāta) in the sense that in it no thing is cognized (sam-prajñāyate): this yoga is inhibition of the mental process.\n\nWhat is the nature of that mind, inhibition of whose processes is called yoga? To explain mind and its processes and their inhibition, the commentator says:\n\nNow mind always tends towards illumination, activity, or stasis (sthiti); so it consists of the three guṇa-s.\n\nMind is said to consist of the three guṇa-s, because it is always tending towards illumination, activity, or stasis. Illumination is making known, bringing to light, that being characteristic of sattva guṇa. Activity is motion and operation, that being characteristic of rajas. Stasis is being stationary, limitation, and resistance, such being characteristic of tamas. These are the invariable tendencies of the guṇa-s, and as mind is always tending towards one of them, it is true to say that it is continual transformation of the three guṇa-s.\n\nTo the objection that illumination and the others have not been established as causes, he says:\n\nFor mind-sattva is by nature illumination.\n\nThe word For means that this is something generally accepted; it is well known in the world and from scripture how mind makes everything manifest. So mind is sattva, and is therefore called mind-sattva, because its main transformation is that of sattva.\n\nOr again, mind can be pointed out clearly as pure knowledge (khyāti) having other mental processes mutually combining and separating. So it is that he says For mind-sattva is by nature illumination.\n\nMingled with rajas and tamas, mind is drawn towards power and possessions. Pervaded by tamas, it becomes subject to a-dharma, Ignorance, attachment and helplessness. That same mind, when the covering of illusion (moha) has dwindled, pervaded by a measure of rajas, is endowed with dharma, knowledge (jñāna), detachment and power. When the last trace of the stain of rajas is removed, the mind is grounded in its own nature, becoming simply the Knowledge (khyāti) that sattva and Puruṣa are different, and it is endowed with the Rain-cloud of Dharma, which the meditators call the highest prasaṅkhyāna (continuous meditation on Knowledge).\n\nNow he explains the conflicting varieties of mental processes which arise from relative dominance or subordination of rajas and tamas. When sattva is predominant, but mingled with rajas and tamas, they being equally strong, mind becomes fond of power and possessions, and this fondness for them is passion. The meaning is, that thoughts arise concentrated on the passion for power and possessions.\n\nWhen that mind, which is illumination by nature, is pervaded by tamas, with rajas subordinate in it, then tainted thoughts arise of a-dharma and the other three (Ignorance, passion, and helplessness).\n\nThat same mind, when the covering of illusion has dwindled, when tamas has been overcome, as when the rain-cloud passes away the darkness is at an end and the sun-disc illumines everything pervaded by a measure by a trace of rajas, is endowed with dharma, etc. (knowledge, detachment, and power), and pure thoughts of dharma and the others arise.\n\nWhen the last stain of the trace of rajas is removed, the mind is grounded in its own nature in its own nature as illumination and that alone. It becomes simply the Knowledge that sattva and Puruṣa are different. Mind is sattva, and Puruṣa is the experiencer (bhoktṛ); discriminating them as different is Knowledge (khyāti) of them, awareness of them. The word simply indicates that it is free from taints or any other things (than Knowledge). It is endowed with the meditation called Rain-cloud of Dharma, this being the samādhi of that name.\n\nThe mind overcomes rajas and tamas by power of prasaṅkhyāna, which is meditation (dhyāna) established in the perception of the nature of Puruṣa alone, pure Knowledge itself, which the meditators the yogins call the highest prasaṅkhyāna (continuous meditation on Knowledge).\n\nThe power-of-consciousness is unchangeable, does not engage with objects, has the objects shown to it, is pure and infinite.\n\nHaving explained what the mental process is in itself, he shows how it is to be inhibited. The power-of-consciousness (citi-śakti) is unchangeable: consciousness alone is power, so it is called power-of-consciousness. Powers which blossom out only in births appropriate to the possession of those powers are not inherent power, but consciousness is inherent power, dependent on nothing else. It is therefore eternally established. The apposition of the word consciousness (citi) meaning pure consciousness (cinmātra) and the word power (śakti) is to show that the subjective consciousness is of unvarying nature. This being so, it is something unchanging. When in an abiding possessor-of-qualities (dharmin), one quality (dharma) gives way to a different one, that is called change. Since this consciousness never changes, it is unchanging. For just this reason, it does not engage with objects. For it is only things like mind, which do change, that are found to engage with objects.\n\nSo the various objects are shown to it: an object is shown to it through the mind (antaḥ-karaṇa). Therefore it is pure and therefore in space and in time it is infinite. (In this explanation which has been given) each fact is to be understood as the cause of the next one.\n\nOpposed to pure consciousness is Knowledge-of-the-difference (viveka-khyāti), whose nature is sattva-guṇa. Therefore the mind, turning away from even that Knowledge, inhibits it.\n\nAn example of the contrary is mind and senses. Opposed to pure consciousness is Knowledge-of-the-difference, whose nature is sattva-guṇa. Sattva-guṇa means pure sattva, and its essence is that alone. To say that its nature is sattva means that its nature is essentially to illumine. Again, it is said to be essentially sattva-guṇa because this thought is not concerned with any object of the world.\n\nAgain, Knowledge is bound by the very fact of being Knowledge, just because it is essentially sattva. This Knowledge being thus distinct from, and opposed to, the characteristics of the power-of-consciousness described, does have changes and so on.\n\nBeing associated with qualities like change, it is inferior to the supreme Puruṣa which is free from them. Therefore because it sees the defect (doṣa) in its own nature, the mind, turning away from giving up even that Knowledge, inhibits it.\n\nIn this state what remains is saṃskāra-s, and it is the seedless (nirbīja) samādhi. There is no cognition of anything in it, so it is ultra-cognitive. This yoga is inhibition of the mental processes.\n\nIn this state the state of inhibition what remains is saṃskāra-s; only saṃskāra-s are left. This samādhi in this state of inhibition is the seedless. The meaning is, that here the seed is gone; in this all the seeds of taint and so on are gone.\n\nTo show this very mark of the ultra-cognitive samādhi, he quotes the sūtra, This yoga is inhibition of the mental processes.\n\nWhat is Puruṣa, the cognizer of buddhi (buddhi-bodhātman), in that state when there is no object for him?",
          "references": "Mahabhasya, I.1: atha śabdānuśāsanam",
          "tags": "Grammarians"
        }
      },
      {
        "data": {
          "id": "I.2",
          "label": "yogaś citta-vṛtti-nirodha",
          "Translation_Bryant": "Yoga is the stilling of the changing states of the mind.",
          "tags": "Samkhya, Buddhism",
          "Translation_Leggett": "Yoga is inhibition of the mental processes"
        }
      },
      {
        "data": {
          "id": "I.3",
          "label": "tadā draṣṭuḥ svarūpe ‘vasthānam",
          "Translation_Bryant": "When that is accomplished, the seer abides in its own true nature.",
          "comment": "<strong>Comments:</strong> ",
          "tags": "Upanishad",
          "Translation_Leggett": "Then the Seer is established in his own nature"
        }
      },
      {
        "data": {
          "id": "I.4",
          "label": "vṛtti-sārūpyam itaratra",
          "Translation_Bryant": "Otherwise, at other times, [the seer] is absorbed in the changing states [of the mind].",
          "tags": "Samkhya",
          "Translation_Leggett": "Otherwise, it conforms itself to the mental process"
        }
      },
      {
        "data": {
          "id": "I.5",
          "label": "vṛttayaḥ pañcatayyaḥ kliṣṭākliṣṭāḥ",
          "Translation_Bryant": "There are five kinds of changing states of the mind, and they are either detrimental or nondetrimental [to the practice of yoga].",
          "tags": "Samkhya, Buddhism",
          "Translation_Leggett": "The mental processes are of five kinds; they are tainted or pure"
        }
      },
      {
        "data": {
          "id": "I.6",
          "label": "pramāṇa-viparyaya-vikalpa-nidrā-smṛtayaḥ",
          "Translation_Bryant": "[These five vṛttis are] right knowledge, error, imagination, sleep, and memory.",
          "Translation_Leggett": "Right knowledge, illusion, logical construction, sleep, memory"
        }
      },
      {
        "data": {
          "id": "I.7",
          "label": "pratyakṣānumānāgamāḥ pramāṇāni",
          "Translation_Bryant": "Right knowledge consists of sense perception, logic, and verbal testimony.",
          "tags": "Samkhya, Upanishad",
          "Translation_Leggett": "Right knowledge is either direct perception, inference, or authority"
        }
      },
      {
        "data": {
          "id": "I.8",
          "label": "viparyayo mithyā-jñānam atad-rūpa-pratiṣṭham",
          "Translation_Bryant": "Error is false knowledge stemming from the incorrect apprehension [of something].",
          "Translation_Leggett": "Illusion is false knowledge based on an untrue form"
        }
      },
      {
        "data": {
          "id": "I.9",
          "label": "śabda-jñānānupātī vastu-śūnyo vikalpaḥ",
          "Translation_Bryant": "Metaphor consists of the usage of words that are devoid of an actual object.",
          "Translation_Leggett": "Logical construction is something that follows verbal knowledge but has no real object"
        }
      },
      {
        "data": {
          "id": "I.10",
          "label": "abhāva-pratyayālambanā vṛttir nidrā",
          "Translation_Bryant": "Deep sleep is that state of mind which is based on an absence [of any content].",
          "Translation_Leggett": "The mental process which rests on the notion of non-existence is sleep"
        }
      },
      {
        "data": {
          "id": "I.11",
          "label": "anubhūta-viṣayāsampramoṣaḥ smṛtiḥ",
          "Translation_Bryant": "Memory is the retention of [images of] sense objects that have been experienced.",
          "tags": "Buddhism",
          "Translation_Leggett": "Memory is not letting slip away an object experienced"
        }
      },
      {
        "data": {
          "id": "I.12",
          "label": "abhyāsa-vairāgyābhyāṁ tan-nirodhaḥ",
          "Translation_Bryant": "[The vṛtti states of mind] are stilled by practice and dispassion.",
          "Translation_Leggett": "Their inhibition is by practice and detachment"
        }
      },
      {
        "data": {
          "id": "I.13",
          "label": "tatra sthitau yatno ‘bhyāsaḥ",
          "Translation_Bryant": "From these, practice is the effort to be fixed in concentrating the mind.",
          "Translation_Leggett": "Practice is the effort at steadiness in it"
        }
      },
      {
        "data": {
          "id": "I.14",
          "label": "sa tu dīrgha-kāla-nairantarya-satkārāsevito dṛḍha-bhūmiḥ",
          "Translation_Bryant": "Practice becomes firmly established when it has been cultivated uninterruptedly and with devotion over a prolonged period of time.",
          "Translation_Leggett": "But practised for a long time, uninterruptedly and with reverence, it becomes firmly grounded"
        }
      },
      {
        "data": {
          "id": "I.15",
          "label": "dṛṣṭānuśravika-viṣaya-vitṛṣṇasya vaśīkāra-saṁjñā vairāgyam",
          "Translation_Bryant": "Dispassion is the controlled consciousness of one who is without craving for sense objects, whether these are actually perceived, or described [in scripture].",
          "Translation_Leggett": "Detachment is consciousness of self-mastery, of one who has no thirst for any object either seen or heard about"
        }
      },
      {
        "data": {
          "id": "I.16",
          "label": "tat paraṁ puruṣa-khyāter guṇa-vaitṛṣṇyam",
          "Translation_Bryant": "Higher than renunciation is indifference to the guṇas [themselves]. This stems from perception of the […]",
          "Translation_Leggett": "It is the higher detachment when from knowledge of Puruṣa there is no thirst for (even) the guṇa-s"
        }
      },
      {
        "data": {
          "id": "I.17",
          "label": "vitarka-vicārānandāsmitā-rūpānugamāt samprajñātaḥ",
          "Translation_Bryant": "Samprajñāta [samādhi] consists of [the consecutive] mental stages of absorption with physical awareness, absorption with subtle awareness, absorption with bliss, and absorption with the sense of I-ness.",
          "Translation_Leggett": "It is cognitive because accompanied with verbal associations (vitarka), with subtle associations (vicāra), with joy (ānanda), and the form of I-am-ness (asmitā)"
        }
      },
      {
        "data": {
          "id": "I.18",
          "label": "virāma-pratyayābhyāsa-pūrvaḥ saṁskāra-śeṣo ‘nyaḥ",
          "Translation_Bryant": "The other samādhi [asamprajñāta-samādhi] is preceded by cultivating the determination to terminate [all thoughts]. [In this state] only latent impressions remain.",
          "Translation_Leggett": "The other (samādhi) follows on practice of the idea of stopping, and consists of saṃskāra-s alone"
        }
      },
      {
        "data": {
          "id": "I.19",
          "label": "bhava-pratyayo videha-prakṛti-layānām",
          "Translation_Bryant": "For [some], those who are unembodied and those who are merged in matter, [the state of samprajñāta is characterized] by absorption in [subtle] states of prakṛti.",
          "Translation_Leggett": "It results from birth in the case of gods discarnate, and in the case of those who absorb themselves into prakṛti"
        }
      },
      {
        "data": {
          "id": "I.20",
          "label": "śraddhā-vīrya-smṛti-samādhi-prajñā-pūrvaka itareṣām",
          "Translation_Bryant": "[But] for others, [the state where only subconscious impressions remain] is preceded by faith, vigor, memory, samādhi absorption, and discernment.",
          "Translation_Leggett": "For the others, it comes after faith, energy, memory, (cognitive) samādhi, and knowledge",
          "references": "",
          "comment": ""
        }
      },
      {
        "data": {
          "id": "I.21",
          "label": "tīvra-saṁvegānām āsannaḥ",
          "Translation_Bryant": "[This state of samprajñāta] is near for those who apply themselves intensely.",
          "Translation_Leggett": "For those who practise with ardent energy, it is near"
        }
      },
      {
        "data": {
          "id": "I.22",
          "label": "mṛdu-madhyādhimātratvāt tato ‘pi viśeṣaḥ",
          "Translation_Bryant": "Even among these, there is further differentiation [of this intensity into degrees of] mild, mediocre, and ardent.",
          "Translation_Leggett": "Even among the ardent, there is a distinction of mild or moderate or intense"
        }
      },
      {
        "data": {
          "id": "I.23",
          "label": "Īśvara-praṇidhānād vā",
          "Translation_Bryant": "Or, [this previously mentioned state is attainable] from devotion to the Lord.",
          "Translation_Leggett": "Or by special devotion to the Lord"
        }
      },
      {
        "data": {
          "id": "I.24",
          "label": "kleśa-karma-vipākāśayair aparāmṛṣṭaḥ puruṣa-viśeṣa Īśvaraḥ",
          "Translation_Bryant": "The Lord is a special soul[…]",
          "Translation_Leggett": "Untouched by taints or karma-s or their fruition or their latent stocks is the Lord, who is a special kind of Puruṣa"
        }
      },
      {
        "data": {
          "id": "I.25",
          "label": "tatra niratiśāyam sarvajña-bījam",
          "Translation_Bryant": "In him, the seed of omniscience is unsurpassed.",
          "Translation_Leggett": "In whom the seed of omniscience becomes transcendent"
        }
      },
      {
        "data": {
          "id": "I.26",
          "label": "pūrveṣām api guruḥ kālenānavacchedāt",
          "Translation_Bryant": "Īśvara was also the teacher of the ancients, because he is not limited by Time.",
          "Translation_Leggett": "The teacher of even the first teachers, because not particularized by time"
        }
      },
      {
        "data": {
          "id": "I.27",
          "label": "tasya vācakaḥ praṇavaḥ",
          "Translation_Bryant": "The name designating him is the mystical syllable oṁ.",
          "Translation_Leggett": "Of him, the expression is praṇava (OM)"
        }
      },
      {
        "data": {
          "id": "I.28",
          "label": "taj-japas tad-artha-bhāvanam",
          "Translation_Bryant": "Its repetition and the contemplation of its meaning [should be performed].",
          "Translation_Leggett": "Repetition of it and meditation on its meaning"
        }
      },
      {
        "data": {
          "id": "I.29",
          "label": "tataḥ pratyak-cetanādhigamo ‘py antarāyābhāvaś ca",
          "Translation_Bryant": "From this comes the realization of the inner consciousness and freedom from all disturbances.",
          "Translation_Leggett": "From that, realization of the separate consciousness, and absence of obstacles"
        }
      },
      {
        "data": {
          "id": "I.30",
          "label": "vyādhi-styāna-saṁśaya-pramādālasyāvirati-bhrānti-darśanālabdha-bhūmikatvānavasthitatvāni citta-vikṣepās te ‘ntarāyāḥ",
          "Translation_Bryant": "These disturbances are disease, idleness, doubt, carelessness, sloth, lack of detachment, misapprehension, failure to attain a base for concentration, and instability. They are distractions for the mind.",
          "Translation_Leggett": "Illness, apathy, doubt, carelessness, laziness, failure to withdraw, misconceptions, failure to attain a state, instability (in the state) – these distractions of the mind are the obstacles"
        }
      },
      {
        "data": {
          "id": "I.31",
          "label": "duḥkha-daurmanasyāṅgam-ejayatva-śvāsa-praśvāsā vikṣepa-saha-bhuvaḥ",
          "Translation_Bryant": "Suffering, dejection, trembling, inhalation, and exhalation accompany the distractions.",
          "Translation_Leggett": "Pain, frustration, restlessness of the body, spasmodic breathing in or out are the accompaniments of these distractions"
        }
      },
      {
        "data": {
          "id": "I.32",
          "label": "tat-pratiṣedhārtham eka-tattvābhyāsaḥ",
          "Translation_Bryant": "Practice [of fixing the mind] on one object [should be performed] in order to eliminate these disturbances.",
          "Translation_Leggett": "To prevent them, practice on one principle"
        }
      },
      {
        "data": {
          "id": "I.33",
          "label": "maitrī-karuṇā-muditopekṣaṇāṁ sukha-duḥkha-puṇyāpuṇya-viṣayāṇāṁ bhāvanātas citta-prasādanam",
          "Translation_Bryant": "By cultivating an attitude of friendship toward those who are happy, compassion toward those in distress; joy toward those who are virtuous, and equanimity toward those who are non-virtuous, lucidity arises in the mind.",
          "Translation_Leggett": "The mind is made clear by meditation on friendliness towards the happy, compassion for the suffering, goodwill towards the virtuous, and disinterest in the sinful"
        }
      },
      {
        "data": {
          "id": "I.34",
          "label": "pracchardana-vidhāraṇābhyāṁ vā prāṇasya",
          "Translation_Bryant": "Or [stability of mind is gained] by exhaling and retaining the breath.",
          "Translation_Leggett": "Or by expulsion and retention of prāṇa"
        }
      },
      {
        "data": {
          "id": "I.35",
          "label": "viṣayavatī vā pravṛttir utpannā manasaḥ sthiti-nibandhanī",
          "Translation_Bryant": "Or else, focus on a sense object arises, and this causes steadiness of the mind.",
          "Translation_Leggett": "Or achievement of supernormal perception of a divine object brings the mind to steadiness"
        }
      },
      {
        "data": {
          "id": "I.36",
          "label": "viśokā vā jyotiṣmatī",
          "Translation_Bryant": "Or [steadiness of mind is gained when] the mind is pain-free and luminous.",
          "Translation_Leggett": "Or a radiant perception beyond sorrow"
        }
      },
      {
        "data": {
          "id": "I.37",
          "label": "vīta-rāga-viṣayaṁ vā cittam",
          "Translation_Bryant": "Or [the mind becomes steady when it has] one who is free from desire as its object.",
          "Translation_Leggett": "Or on a mind whose meditation is on freedom from passion"
        }
      },
      {
        "data": {
          "id": "I.38",
          "label": "svapna-nidrā-jñānālambanaṁ vā",
          "Translation_Bryant": "Or [the mind can become steady when it has] the knowledge attained from sleep and dreams as its support.",
          "Translation_Leggett": "Or meditating on the knowledge of dream and sleep"
        }
      },
      {
        "data": {
          "id": "I.39",
          "label": "yathābhimata-dhyānād vā",
          "Translation_Bryant": "Or [steadiness of the mind is attained] from meditation upon anything of one’s inclination.",
          "Translation_Leggett": "Or by meditation on what appeals to him"
        }
      },
      {
        "data": {
          "id": "I.40",
          "label": "paramāṇu-parama-mahattvānto ‘sya vaśīkaraḥ",
          "Translation_Bryant": "The yogī’s mastery extends from the smallest particle of matter to the totality of matter.",
          "Translation_Leggett": "His mastery extends right to the ultimate atom and to the ultimate magnitude"
        }
      },
      {
        "data": {
          "id": "I.41",
          "label": "kṣīṇa-vṛtter abhijātasyeva maṇer grahītṛ-grahaṇa-grāhyeṣu tat-stha-tad-añjanatā samāpattiḥ",
          "Translation_Bryant": "Samāpatti, complete absorption of the mind when it is free from its vṛttis, occurs when the mind becomes just like a transparent jewel, taking the form of whatever object is placed before it, whether the object be the knower, the instrument of knowledge, or the object of knowledge.",
          "Translation_Leggett": "Identification-in-samādhi (samāpatti) is when the mental process has dwindled and the mind rests on either the knower or the knowing process or a known object, and like a crystal apparently takes on their respective qualities"
        }
      },
      {
        "data": {
          "id": "I.42",
          "label": "tatra śabdārtha-jñāna-vikalpaiḥ saṅkīrṇā savitarkā-samāpattiḥ",
          "Translation_Bryant": "In this stage, savitarka-samāpatti, “samādhi absorption with physical awareness” is intermixed with the notions of word, meaning, and idea.",
          "Translation_Leggett": "The samādhi-identification is called sa-vitarka when it is mixed up with mental constructs of word, thing and idea"
        }
      },
      {
        "data": {
          "id": "I.43",
          "label": "smṛti-pariśuddhau svarūpa-śūnyevārtha-mātra-nirbhāsā nirvitarkā",
          "Translation_Bryant": "Nirvitarka [samāpatti], “absorption without conceptualization,” occurs when memory has been purged and the mind is empty, as it were, of its own [reflective] nature. Now only the object [of meditation] shines forth [in its own right].",
          "Translation_Leggett": "When there is purification from memories, (that samādhi) apparently empty of its own nature of knowledge, with the object alone shining forth, is nir-vitarka"
        }
      },
      {
        "data": {
          "id": "I.44",
          "label": "etayaiva savicārā nirvicārā ca sūkṣma-viṣayā vyākhyātā",
          "Translation_Bryant": "The states of samādhi with “subtle awareness” and without “subtle awareness,” whose objects of focus are the subtle nature [of things], are explained in the same manner.",
          "Translation_Leggett": "In the same way, when it is on subtle objects, it is called savicāra (with subtle associations) and nir-vicāra (without subtle associations)"
        }
      },
      {
        "data": {
          "id": "I.45",
          "label": "sūkṣma-viṣayatvaṁ cāliṅga-paryavasānam",
          "Translation_Bryant": "The subtle nature of things extends all the way up to prakṛti.",
          "Translation_Leggett": "The scale of (causal) subtlety of objects ends in pradhāna"
        }
      },
      {
        "data": {
          "id": "I.46",
          "label": "tā eva sabījaḥ samādhiḥ",
          "Translation_Bryant": "These above mentioned samāpatti states are [known as] samādhi meditative absorption “with seed.”",
          "Translation_Leggett": "These are samādhi from-a-seed"
        }
      },
      {
        "data": {
          "id": "I.47",
          "label": "nirvicāra-vaiśāradye ‘dhyātma-prasādaḥ",
          "Translation_Bryant": "Upon attaining the clarity of nirvicāra-samādhi, there is lucidity of the inner self.",
          "Translation_Leggett": "From skill in nir-vicāra, a clearness in the self"
        }
      },
      {
        "data": {
          "id": "I.48",
          "label": "ṛtam-bharā tatra prajñā",
          "Translation_Bryant": "In that state, there is truth-bearing wisdom.",
          "Translation_Leggett": "In this, the knowledge is Truth-bearing"
        }
      },
      {
        "data": {
          "id": "I.49",
          "label": "śrutānumāna-prajñābhyām anya-viṣayā viśeṣ ārthatvāt",
          "Translation_Bryant": "It [seedless samādhi] has a different focus from that of inference and sacred scripture, because it has the particularity of things as its object.",
          "Translation_Leggett": "This knowledge is of a particular thing, unlike knowledge from authority or from inference"
        }
      },
      {
        "data": {
          "id": "I.50",
          "label": "taj-jaḥ saṁskāro ‘nya-saṁskāra-pratibandhī",
          "Translation_Bryant": "The saṁskāras born out of that [truth-bearing wisdom] obstruct other saṁskāras [from emerging].",
          "Translation_Leggett": "The saṃskāra produced by it inhibits other saṃskāra-s"
        }
      },
      {
        "data": {
          "id": "I.51",
          "label": "tasyāpi nirodhe sarva-nirodhān nirbījaḥ samādhiḥ",
          "Translation_Bryant": "Upon the cessation of even those [truth-bearing saṁskāras], nirbīja-samādhi, seedless meditative absorption, ensues.",
          "Translation_Leggett": "When that too is inhibited, everything is inhibited, and thus this samādhi is without-seed"
        }
      },
      {
        "data": {
          "id": "II.1",
          "label": "tapaḥ-svādhyāyeśvara-praṇidhānāni kriyā-yogaḥ",
          "Translation_Bryant": "Kriyā-yoga, the path of action, consists of self-discipline, study, and dedication to the Lord."
        }
      },
      {
        "data": {
          "id": "II.2",
          "label": "samādhi-bhāvanārthaḥ kleśa-tanū-karaṇārthaś ca",
          "Translation_Bryant": "[The yoga of action] is for bringing about samādhi and for weakening the impediments [to yoga]."
        }
      },
      {
        "data": {
          "id": "II.3",
          "label": "avidyāsmitā-rāga-dveṣābhinivesāḥ klesāḥ.",
          "Translation_Bryant": "The impediments [to samādhi] are nescience, ego, desire, aversion, and clinging to life."
        }
      },
      {
        "data": {
          "id": "II.4",
          "label": "avidyā kṣetram uttareṣāṁ prasupta-tanu-vicchinnodārāṇām",
          "Translation_Bryant": "Ignorance is the breeding ground of the other kleśas, whether they are in a dormant, weak, intermittent, or fully activated state.",
          "tags": "Buddhism"
        }
      },
      {
        "data": {
          "id": "II.5",
          "label": "anityāśuci-duḥkhānātmasu nitya-śuci-sukhātma-khyātir avidyā",
          "Translation_Bryant": "Ignorance is the notion that takes the self, which is joyful, pure, and eternal, to be the nonself, which is painful, unclean, and temporary."
        }
      },
      {
        "data": {
          "id": "II.6",
          "label": "dṛg-darśana-śaktyor ekātmatevāsmitā",
          "Translation_Bryant": "Ego is [to consider] the nature of the seer and the nature of the instrumental power of seeing to be the same thing."
        }
      },
      {
        "data": {
          "id": "II.7",
          "label": "sukhānuśayī rāgaḥ",
          "Translation_Bryant": "Attachment stems from [experiences] of happiness."
        }
      },
      {
        "data": {
          "id": "II.8",
          "label": "duḥkhānuśayī dveṣaḥ",
          "Translation_Bryant": "Aversion stems from [experiences] of pain."
        }
      },
      {
        "data": {
          "id": "II.9",
          "label": "svarasa-vāhī viduṣo ‘pi tathārūḍho ‘bhiniveśaḥ",
          "Translation_Bryant": "[The tendency of] clinging to life affects even the wise; it is an inherent tendency."
        }
      },
      {
        "data": {
          "id": "II.10",
          "label": "te pratiprasava-heyāḥ sūkṣmāḥ",
          "Translation_Bryant": "These kleśas are subtle; they are destroyed when [the mind] dissolves back into its original matrix."
        }
      },
      {
        "data": {
          "id": "II.11",
          "label": "dhyāna-heyās tad-vṛttayaḥ",
          "Translation_Bryant": "The states of mind produced by these kleśas are eliminated by meditation."
        }
      },
      {
        "data": {
          "id": "II.12",
          "label": "kleśa-mūlaḥ karmāśayo dṛṣṭādṛṣṭa-janma-vedanīyaḥ",
          "Translation_Bryant": "The stock of karma has the kleśas as its root. It is experienced in present or future lives."
        }
      },
      {
        "data": {
          "id": "II.13",
          "label": "sati mūe tad-vipāko jātyāyur-bhogāḥ",
          "Translation_Bryant": "As long as the root [of kleśas] exists, it fructifies as type of birth, span of life, and life experience [of an individual]."
        }
      },
      {
        "data": {
          "id": "II.14",
          "label": "te hlāda-paritāpa-phalāḥ puṇyāpuṇya-hetutvāt",
          "Translation_Bryant": "These [the type of birth, span of life, and life experience] bear the fruits of pleasure and pain, as a result of [the performance of] virtue and vice."
        }
      },
      {
        "data": {
          "id": "II.15",
          "label": "pariṇāma-tāpa-saṁskāra-duḥkhair guṇa-vṛtti-virodhāc ca duḥkham eva sarvaṁ vivekinaḥ",
          "Translation_Bryant": "For one who has discrimination, everything is suffering on account of the suffering produced by the consequences [of action], by pain [itself], and by the saṁskāras, as well as on account of the suffering ensuing from the turmoil of the vṛttis due to the guṇas."
        }
      },
      {
        "data": {
          "id": "II.16",
          "label": "heyaṁ duḥkham anāgatam",
          "Translation_Bryant": "Suffering that has yet to manifest is to be avoided."
        }
      },
      {
        "data": {
          "id": "II.17",
          "label": "draṣṭṛ-drśyayoḥ saṁyogo heya-hetuḥ",
          "Translation_Bryant": "The conjunction between the seer and that which is seen is the cause [of suffering] to be avoided."
        }
      },
      {
        "data": {
          "id": "II.18",
          "label": "prakāśa-kriyā-sthiti-sīlam bhūtendriyātmakaṁ bhogāpavargārthaṁ drśyam",
          "Translation_Bryant": "That which is knowable has the nature of illumination, activity, and inertia [sattva, rajas, and tamas]. It consists of the senses and the elements, and exists for the purpose of [providing] either liberation or experience [to puruṣa]."
        }
      },
      {
        "data": {
          "id": "II.19",
          "label": "viśeṣāviśeṣa-liṅga-mātrālingāni guṇa-parvāṇi",
          "Translation_Bryant": "The different stages of the guṇa qualities consist of the particularized, the unparticularized, the distinctive, and the indistinctive."
        }
      },
      {
        "data": {
          "id": "II.20",
          "label": "draṣṭā dṛśi-mātraḥ śuddho ‘pi pratyayānupaśyaḥ",
          "Translation_Bryant": "The seer is merely the power of seeing; [however,] although pure, he witnesses the images of mind."
        }
      },
      {
        "data": {
          "id": "II.21",
          "label": "tad-artha eva dṛśyasyātmā",
          "Translation_Bryant": "The essential nature of that which is seen is exclusively for the sake of the seer."
        }
      },
      {
        "data": {
          "id": "II.22",
          "label": "kṛtārthaṁ prati naṣṭam apy anaṣṭam tad-anya-sādhāraṇatvāt",
          "Translation_Bryant": "Although the seen ceases to exist for one whose purpose is accomplished [the liberated puruṣa], it has not ceased to exist altogether, since it is common to other [not-liberated] puruṣas."
        }
      },
      {
        "data": {
          "id": "II.23",
          "label": "kṛtārthaṁ prati naṣṭam apy anaṣṭam tad-anya-sādhāraṇatvāt",
          "Translation_Bryant": "Although the seen ceases to exist for one whose purpose is accomplished [the liberated puruṣa], it has not ceased to exist altogether, since it is common to other [not-liberated] puruṣas."
        }
      },
      {
        "data": {
          "id": "II.24",
          "label": "tasya hetur avidyā",
          "Translation_Bryant": "The cause of conjunction is ignorance."
        }
      },
      {
        "data": {
          "id": "II.25",
          "label": "tad-abhāvāt saṁyogābhāvo hānaṁ tad-dṛśeḥkaivalyam",
          "Translation_Bryant": "By the removal of ignorance, conjunction is removed. This is the absolute freedom of the seer.",
          "tags": "Kaivalya"
        }
      },
      {
        "data": {
          "id": "II.26",
          "label": "viveka-khyātir aviplavā hānopāyaḥ",
          "Translation_Bryant": "The means to liberation is uninterrupted discriminative discernment."
        }
      },
      {
        "data": {
          "id": "II.27",
          "label": "tasya saptadhā prānta-bhūmiḥ prajñā",
          "Translation_Bryant": "The yogī’s true insight has seven ultimate stages."
        }
      },
      {
        "data": {
          "id": "II.28",
          "label": "yogāṅgānuṣṭhānād aśuddhi-kṣaye jñāna-dīptir-āviveka-khyāteḥ",
          "Translation_Bryant": "Upon the destruction of impurities as a result of the practice of yoga, the lamp of knowledge arises. This culminates in discriminative discernment."
        }
      },
      {
        "data": {
          "id": "II.29",
          "label": "yama-niyamāsana-prāṇāyāma-pratyāhāra-dhāraṇā-dhyāna-samādhayo ‘ṣṭāv aṅgāni",
          "Translation_Bryant": "The eight limbs are abstentions, observances, posture, breath control, disengagement of the senses, concentration, meditation, and absorption."
        }
      },
      {
        "data": {
          "id": "II.30",
          "label": "ahimsā-satyāsteya-brahmacaryāparigrahā yamāḥ",
          "Translation_Bryant": "The yamas are nonviolence, truthfulness, refrainment from stealing, celibacy, and renunciation of [unnecessary] possessions."
        }
      },
      {
        "data": {
          "id": "II.31",
          "label": "jāti-deśa-kāla-samayānavacchinnāḥ sārva-bhaumā mahā-vratam",
          "Translation_Bryant": "[These yamas] are considered the great vow. They are not exempted by one’s class, place, time, or circumstance. They are universal."
        }
      },
      {
        "data": {
          "id": "II.32",
          "label": "śauca-santoṣa-tapaḥ-svādhyāyeśvara-praṇidhānāni niyamāḥ",
          "Translation_Bryant": "The observances are cleanliness, contentment, austerity, study [of scripture], and devotion to God."
        }
      },
      {
        "data": {
          "id": "II.33",
          "label": "vitarka-bādhane pratipakṣa-bhāvanam",
          "Translation_Bryant": "Upon being harassed by negative thoughts, one should cultivate counteracting thoughts."
        }
      },
      {
        "data": {
          "id": "II.34",
          "label": "vitarkā hiṁsādayaḥ kṛta-kāritānumoditā lobha-krodha-moha-pūrvakā mṛdu-madhyādhimātrā duḥkhājñānānanta-phalā iti pratipakṣa-bhāvanam",
          "Translation_Bryant": "Negative thoughts are violence, etc. They may be [personally] performed, performed on one’s behalf by another, or authorized by oneself; they may be triggered by greed, anger, or delusion; and they may be slight, moderate, or extreme in intensity. One should cultivate counteracting thoughts, namely, that the end results [of negative thoughts] are ongoing suffering and ignorance."
        }
      },
      {
        "data": {
          "id": "II.35",
          "label": "ahiṁsā-pratiṣṭhāyāṁ tat-sannidhau vaira-tyāgaḥ",
          "Translation_Bryant": "In the presence of one who is established in nonviolence, enmity is abandoned."
        }
      },
      {
        "data": {
          "id": "II.36",
          "label": "satya-pratiṣṭhāyāṁ kriyā-phalāśrayatvam",
          "Translation_Bryant": "When one is established in truthfulness, one ensures the fruition of actions."
        }
      },
      {
        "data": {
          "id": "II.37",
          "label": "asteya-pratiṣṭhāyāṁ sarva-ratnopasthānam",
          "Translation_Bryant": "When one is established in refrainment from stealing, all jewels manifest."
        }
      },
      {
        "data": {
          "id": "II.38",
          "label": "brahmacarya-pratiṣṭhāyāṁ vīrya-lābhaḥ",
          "Translation_Bryant": "Upon the establishment of celibacy, power is attained."
        }
      },
      {
        "data": {
          "id": "II.39",
          "label": "aparigraha-sthairye janma-kathantā-sambodhaḥ",
          "Translation_Bryant": "When refrainment from covetousness becomes firmly established, knowledge of the whys and wherefores of births manifests."
        }
      },
      {
        "data": {
          "id": "II.40",
          "label": "śaucāt svāṅga-jugupsā parair asaṁsargaḥ",
          "Translation_Bryant": "By cleanliness, one [develops] distaste for one’s body and the cessation of contact with others."
        }
      },
      {
        "data": {
          "id": "II.41",
          "label": "sattva-śuddhi-saumanasyaikāgryendriya-jayātma-darśana-yogyatvāni ca",
          "Translation_Bryant": "Upon the purification of the mind, [one attains] cheerfulness, one-pointedness, sense control, and fitness to perceive the self."
        }
      },
      {
        "data": {
          "id": "II.42",
          "label": "santoṣād anuttamaḥ sukha-lābhaḥ",
          "Translation_Bryant": "From contentment, the highest happiness is attained."
        }
      },
      {
        "data": {
          "id": "II.43",
          "label": "kāyendriya-siddhir aśuddhi-kṣayāt tapasaḥ",
          "Translation_Bryant": "From austerity, on account of the removal of impurities, the perfection of the senses and body manifests."
        }
      },
      {
        "data": {
          "id": "II.44",
          "label": "svādhyāyād iṣṭa-devatā-samprayogaḥ",
          "Translation_Bryant": "From study [of scripture], a connection with one’s deity of choice is established."
        }
      },
      {
        "data": {
          "id": "II.45",
          "label": "samādhi-siddhir īśvara-praṇidhānāt",
          "Translation_Bryant": "From submission to God comes the perfection of samādhi."
        }
      },
      {
        "data": {
          "id": "II.46",
          "label": "sthira-sukham āsanam",
          "Translation_Bryant": "Posture should be steady and comfortable."
        }
      },
      {
        "data": {
          "id": "II.47",
          "label": "prayatna-śaithilyānanta-samāpattibhyām",
          "Translation_Bryant": "[Such posture should be attained] by the relaxation of effort and by absorption in the infinite."
        }
      },
      {
        "data": {
          "id": "II.48",
          "label": "tato dvandvānabhighātaḥ",
          "Translation_Bryant": "From this, one is not afflicted by the dualities of the opposites."
        }
      },
      {
        "data": {
          "id": "II.49",
          "label": "tasmin sati śvāsa-praśvāsayor gati-vicchedaḥ prāṇāyāmaḥ",
          "Translation_Bryant": "When that [āsana] is accomplished, prāṇāyāma, breath control, [follows]. This consists of the regulation of the incoming and outgoing breaths."
        }
      },
      {
        "data": {
          "id": "II.50",
          "label": "bā hyābhyantara-stambha-vṛttiḥ deśa-kāla-saṅkhyābhiḥ paridṛṣṭo dīrgha-sūkṣmaḥ",
          "Translation_Bryant": "[Prāṇāyāma] manifests as external, internal, and restrained movements [of breath]. These are drawn out and subtle in accordance with place, time, and number."
        }
      },
      {
        "data": {
          "id": "II.51",
          "label": "bā hyābhyantara-viṣayākṣepī caturthaḥ",
          "Translation_Bryant": "The fourth [type of prāṇāyāma] surpasses the limits of the external and the internal."
        }
      },
      {
        "data": {
          "id": "II.52",
          "label": "tataḥ kṣīyate prakāśāvaraṇam",
          "Translation_Bryant": "Then, the covering of the illumination [of knowledge] is weakened."
        }
      },
      {
        "data": {
          "id": "II.53",
          "label": "dhāraṇāsu ca yogyatā manasaḥ",
          "Translation_Bryant": "Additionally, the mind becomes fit for concentration."
        }
      },
      {
        "data": {
          "id": "II.54",
          "label": "svaviṣayāsamprayoge cittasya svarūpānukāra ivendriyāṇāṁ pratyāhāraḥ",
          "Translation_Bryant": "Pratyāhāra, withdrawal from sense objects, occurs when the senses do not come into contact with their respective sense objects. It corresponds, as it were, to the nature of the mind [when it is withdrawn from the sense objects]."
        }
      },
      {
        "data": {
          "id": "II.55",
          "label": "tataḥ paramā vaśyatendriyāṇām",
          "Translation_Bryant": "From this comes the highest control of the senses."
        }
      },
      {
        "data": {
          "id": "III.1",
          "label": "deśa-bandhaś cittasya dhāraṇā",
          "Translation_Bryant": "Concentration is the fixing of the mind in one place."
        }
      },
      {
        "data": {
          "id": "III.2",
          "label": "tatra pratyayaika-tānatā dhyānam",
          "Translation_Bryant": "Meditation is the one-pointedness of the mind on one image."
        }
      },
      {
        "data": {
          "id": "III.3",
          "label": "tad evārtha-mātra-nirbhāsaṁ svarūpa-śūnyam iva samādhiḥ",
          "Translation_Bryant": "Samādhi is when that same dhyāna shines forth as the object alone and [the mind] is devoid of its own [reflective] nature."
        }
      },
      {
        "data": {
          "id": "III.4",
          "label": "trayam ekatra saṁyamaḥ",
          "Translation_Bryant": "When these three are performed together, it is called saṁyama."
        }
      },
      {
        "data": {
          "id": "III.5",
          "label": "taj-jayāt prajñālokaḥ",
          "Translation_Bryant": "From saṁyama comes insight."
        }
      },
      {
        "data": {
          "id": "III.6",
          "label": "tasya bhūmiṣu viniyogaḥ",
          "Translation_Bryant": "Saṁyama is applied on the [different] stages [of samādhi]."
        }
      },
      {
        "data": {
          "id": "III.7",
          "label": "trayam antaraṅgam pūrvebhyaḥ",
          "Translation_Bryant": "These three [dhāraṇā, dhyāna, and samādhi] are internal limbs compared to the previous limbs [of yoga]."
        }
      },
      {
        "data": {
          "id": "III.8",
          "label": "tad api bahir-aṅgaṁ nirbījasya",
          "Translation_Bryant": "Yet even these are external limbs in relation to “seedless” samādhi."
        }
      },
      {
        "data": {
          "id": "III.9",
          "label": "vyutthāna-nirodha-saṁskārayor abhibhava-prādurbhāvau nirodha-kṣaṇa-cittānvayo nirodha-pariṇāmaḥ",
          "Translation_Bryant": "The state of restraint, nirodha, is when there is disappearance of outgoing [i.e., worldly] saṁskāras and the appearance of restraining saṁskāras. These emerge in the mind at the moment of restraint."
        }
      },
      {
        "data": {
          "id": "III.10",
          "label": "tasya praśānta-vā hitā saṁskārāt",
          "Translation_Bryant": "The mind’s undisturbed flow occurs due to saṁskāras."
        }
      },
      {
        "data": {
          "id": "III.11",
          "label": "sarvārthataikāgratayoḥ kṣayodayau cittasya samādhi-pariṇāmaḥ",
          "Translation_Bryant": "The attainment of the samādhi state involves the elimination of all-pointedness [i.e., wandering] of the mind and the rise of one-pointedness [i.e., concentration]."
        }
      },
      {
        "data": {
          "id": "III.12",
          "label": "tataḥ punaḥ śāntoditau tulya-pratyayau cittasyaikāgratā-pariṇāmaḥ",
          "Translation_Bryant": "In that regard, the attainment of one-pointedness occurs when the image in the mind that has just passed is the same as the image in the mind that is present."
        }
      },
      {
        "data": {
          "id": "III.13",
          "label": "etena bhūtendriyeṣu dharma-lakṣaṇāvasthā-pariṇāmā vyākhyātāḥ",
          "Translation_Bryant": "In this way, the change in the characteristics, state, and condition of objects and of the senses is explained."
        }
      },
      {
        "data": {
          "id": "III.14",
          "label": "śāntoditāvyapadeśya-dharmānupātī dharmī",
          "Translation_Bryant": "The substratum is that which underpins past, present, and future."
        }
      },
      {
        "data": {
          "id": "III.15",
          "label": "kramānyatvaṁ pariṇāmaṅyatve hetuḥ",
          "Translation_Bryant": "The change in the sequence [of characteristics] is the cause of the change in transformations [of objects]."
        }
      },
      {
        "data": {
          "id": "III.16",
          "label": "pariṇāma-traya-saṁyamād atītānāgata-jñānam",
          "Translation_Bryant": "When saṁyama is performed on the three transformations [of characteristics, state, and condition], knowledge of the past and the future ensues."
        }
      },
      {
        "data": {
          "id": "III.17",
          "label": "śabdārtha-pratyayānām itaretarādhyāsāt saṅkaras tat-pravibhāga-saṁyamāt sarva-bhūta-ruta-jñānam",
          "Translation_Bryant": "Due to the correlation among word, meaning, and idea, confusion ensues. By performing saṁyama on them separately, knowledge of the speech of all creatures arises."
        }
      },
      {
        "data": {
          "id": "III.18",
          "label": "saṁskāra-sākṣātkaraṇāt pūrva-jāti-jñānam",
          "Translation_Bryant": "By bringing [previous] saṁskāras into direct perception comes the knowledge of previous births."
        }
      },
      {
        "data": {
          "id": "III.19",
          "label": "pratyayasya para-citta-jñānam",
          "Translation_Bryant": "From [their] ideas, one can attain knowledge of others’ minds."
        }
      },
      {
        "data": {
          "id": "III.20",
          "label": "na ca tat-sālambanaṁ tasyāviṣayībhūtatvāt",
          "Translation_Bryant": "That knowledge is not accompanied by its object, since this object is not the object [of the yogī’s mind]."
        }
      },
      {
        "data": {
          "id": "III.21",
          "label": "kāya-rūpa-saṁyamāt tad-grāhya-śakti-stambhe cakṣuḥ-prakāśāsamprayoge ‘ntardhānam",
          "Translation_Bryant": "By performing saṁyama on the outer form of the body, invisibility [is attained]. This occurs when perceptibility is obstructed by blocking contact between light and the eyes."
        }
      },
      {
        "data": {
          "id": "III.22",
          "label": "sopakramaṁ nirupakramaṁ ca karma tat-saṁyamād aparānta-jñānam ariṣṭebhyo vā",
          "Translation_Bryant": "Karma is either quick to fructify or slow. By saṁyama on karma, or on portents, knowledge of [one’s] death arises."
        }
      },
      {
        "data": {
          "id": "III.23",
          "label": "maitryādiṣu balāni",
          "Translation_Bryant": "By [saṁyama] on friendliness and such things, strengths are acquired."
        }
      },
      {
        "data": {
          "id": "III.24",
          "label": "baleṣu hasti-balādīni",
          "Translation_Bryant": "[By practicing saṁyama] on strengths, [the yogī] attains the strength of an elephant, etc."
        }
      },
      {
        "data": {
          "id": "III.25",
          "label": "pravṛttyāloka-nyāsāt sūkṣma-vyavahita-viprakṛṣṭa-jñānam",
          "Translation_Bryant": "By directing the light of cognition, one obtains knowledge of subtle, concealed, and remote things."
        }
      },
      {
        "data": {
          "id": "III.26",
          "label": "bhuvana-jñānaṁ sūrye saṁyamāt",
          "Translation_Bryant": "By performing saṁyama on the sun arises knowledge of the different realms in the universe."
        }
      },
      {
        "data": {
          "id": "III.27",
          "label": "candre tārā-vyūha-jñānam",
          "Translation_Bryant": "[By saṁyama] on the moon, knowledge of the solar systems."
        }
      },
      {
        "data": {
          "id": "III.28",
          "label": "dhruve tad-gati-jñānam",
          "Translation_Bryant": "[By saṁyama] on the polestar comes knowledge of the movement of the stars."
        }
      },
      {
        "data": {
          "id": "III.29",
          "label": "nābhi-cakre kāya-vyūha-jñānam",
          "Translation_Bryant": "[By saṁyama] on the navel plexus of the body comes knowledge of the arrangement of the body."
        }
      },
      {
        "data": {
          "id": "III.30",
          "label": "kaṇṭha-kūpe kṣut-pipāsā-nivṛttiḥ",
          "Translation_Bryant": "[By saṁyama] on the pit of the throat comes the cessation of hunger and thirst."
        }
      },
      {
        "data": {
          "id": "III.31",
          "label": "kūrma-nāḍyāṁ sthairyam",
          "Translation_Bryant": "[By saṁyama] on the subtle tortoise channel, steadiness is attained."
        }
      },
      {
        "data": {
          "id": "III.32",
          "label": "mūrdha-jyotiṣi siddha-darśanam",
          "Translation_Bryant": "[By saṁyama] on the light in the skull, a vision of the siddhas, perfected beings, is attained."
        }
      },
      {
        "data": {
          "id": "III.33",
          "label": "prātibhād vā sarvam",
          "Translation_Bryant": "Or, by intuition, comes [knowledge of] everything."
        }
      },
      {
        "data": {
          "id": "III.34",
          "label": "hṛdaye citta-saṁvit",
          "Translation_Bryant": "[By saṁyama] on the heart, knowledge of the mind ensues."
        }
      },
      {
        "data": {
          "id": "III.35",
          "label": "sattva-puruṣayor atyantāsaṅkīrṇayoḥ pratyayāviśeṣo bhogaḥ parārthatvāt svārtha-saṁyamāt puruṣa-jñānam",
          "Translation_Bryant": "Worldly experience consists of the notion that there is no distinction between the puruṣa self and pure intelligence, although these two are completely distinct. Worldly experience exists for another [i.e., for puruṣa]. [By saṁyama] on that which exists for itself [i.e., on puruṣa], comes knowledge of puruṣa."
        }
      },
      {
        "data": {
          "id": "III.36",
          "label": "tataḥ prātibha-śrāvaṇa-vedanādarśāsvāda-vārtā jāyante",
          "Translation_Bryant": "From this, intuition as well as higher hearing, touch, vision, taste, and smell are born."
        }
      },
      {
        "data": {
          "id": "III.37",
          "label": "te samādhāv upasargāḥ vyutthāne siddhayaḥ",
          "Translation_Bryant": "These powers are accomplishments for the mind that is outgoing but obstacles to samādhi."
        }
      },
      {
        "data": {
          "id": "III.38",
          "label": "bandha-kāraṇa-śaithilyāt pracāra-saṁvedanāc ca cittasya para-śarīrāveśaḥ",
          "Translation_Bryant": "By loosening the cause of bondage, and by knowledge of the passageways of the mind, the mind can enter into the bodies of others."
        }
      },
      {
        "data": {
          "id": "III.39",
          "label": "udāna-jayāj jala-paṅka-kaṇṭakādiṣv asaṅga utkrāntiś ca",
          "Translation_Bryant": "By mastery over the udāna vital air, one attains [the power of] levitation and does not come into contact with water, mud, and thorns, etc."
        }
      },
      {
        "data": {
          "id": "III.40",
          "label": "samāna-jayāt jvalanam",
          "Translation_Bryant": "By mastery over the samāna vital air, radiance is attained."
        }
      },
      {
        "data": {
          "id": "III.41",
          "label": "śrotrākāśayoḥ sambandha-saṁyamād divyaṁ śrotram",
          "Translation_Bryant": "By saṁyama on the relationship between the organ of hearing and the ether, divine hearing is attained."
        }
      },
      {
        "data": {
          "id": "III.42",
          "label": "kāyākāśayoḥ sambandha-saṁyamāl laghu-tūla-samāpatteś cākāśa-gamanam",
          "Translation_Bryant": "By performing saṁyama on the relationship between the body and ether, and by performing samāpatti on the lightness of cotton, one acquires the ability to travel through the sky."
        }
      },
      {
        "data": {
          "id": "III.43",
          "label": "bahir-akalpitā vṛttir mahā-videhā tataḥ prakāśāvaraṇa-kṣayaḥ",
          "Translation_Bryant": "The state of mind [projected] outside [of the body], which is not an imagined state, is called the great out-of-body [experience]. By this, the covering of the light [of buddhi] is destroyed."
        }
      },
      {
        "data": {
          "id": "III.44",
          "label": "sthūla-svarūpa-sūkṣmānvayārthavattva-saṁyamād bhūta-jayaḥ",
          "Translation_Bryant": "By saṁyama on the gross nature, essential nature, subtle nature, constitution, and purpose [of objects, one attains] mastery over the elements."
        }
      },
      {
        "data": {
          "id": "III.45",
          "label": "tato ‘ṇimādi-prādurbhāvaḥ kāya-sampat-tad-dharmānabhighātaś ca",
          "Translation_Bryant": "As a result of this, there are no limitations on account of the body’s natural abilities; mystic powers such as aṇimā, etc., manifest; and the body attains perfection."
        }
      },
      {
        "data": {
          "id": "III.46",
          "label": "rūpa-lāvaṇya-bala-vajra-saṁ hananatvāni kāya-sampat",
          "Translation_Bryant": "The perfection of the body consists of [possessing] beauty, charm, strength, and the power of a thunderbolt."
        }
      },
      {
        "data": {
          "id": "III.47",
          "label": "grahaṇa-svarūpāsmitānvayārthavattva-saṁyamād indriya-jayaḥ",
          "Translation_Bryant": "By saṁyama on the process of knowing, on the essence [of the sense organs], on ego, on inherence [the guṇas], and on the purpose [of the guṇas] comes control over the senses."
        }
      },
      {
        "data": {
          "id": "III.48",
          "label": "tato mano-javitvaṁ vikaraṇa-bhāvaḥ pradhāna-jayaś ca",
          "Translation_Bryant": "As a result of this comes speed like the speed of mind, activity independent of the bodily senses, and mastery over primordial matter."
        }
      },
      {
        "data": {
          "id": "III.49",
          "label": "sattva-puruṣ ānyatā-khyāti-mātrasya sarva-bhāvādhiṣṭhātṛtvam sarva-jñātṛtvam ca",
          "Translation_Bryant": "Only for one who discerns the difference between the puruṣa and the intellect do omniscience and omnipotence accrue.",
          "tags": "Viveka"
        }
      },
      {
        "data": {
          "id": "III.50",
          "label": "tad-vairāgyād api doṣa-bīja-kṣaye kaivalyam",
          "Translation_Bryant": "By detachment even from this attainment [i.e., omniscience and omnipotence], and upon the destruction of the seeds of all faults, kaivalya, the supreme liberation ensues.",
          "tags": "Kaivalya, "
        }
      },
      {
        "data": {
          "id": "III.51",
          "label": "sthānyupanimantraṇe saṅgasmayākaraṇaṁ punar-aniṣṭa-prasaṅgāt",
          "Translation_Bryant": "If solicited by celestial beings, [the yogī] should not become smug, because the tendency toward undesirable consequences can once again manifest."
        }
      },
      {
        "data": {
          "id": "III.52",
          "label": "kṣaṇa-tat-kramayoḥ saṁyamād-viveka-jaṁ jñānaṁ",
          "Translation_Bryant": "By performing saṁyama on the moment, and its sequence, one attains knowledge born of discrimination.",
          "tags": "Sequence"
        }
      },
      {
        "data": {
          "id": "III.53",
          "label": "jāti-lakṣaṇa-deśair anyatā ‘navacchedāt tulyayos tataḥ pratipattiḥ",
          "Translation_Bryant": "As a result of this, there is discernment of two comparable things that are not distinguishable by species, characteristics, or location."
        }
      },
      {
        "data": {
          "id": "III.54",
          "label": "tārakaṁ sarva-viṣayaṁ sarvathā-viṣayam akramaṁ ceti vivekajaṁ jñānam",
          "Translation_Bryant": "Knowledge born of discrimination is a liberator; it has everything as its object at all times simultaneously."
        }
      },
      {
        "data": {
          "id": "III.55",
          "label": "sattva-puruṣayoh śuddhi-sāmye kaivalyam iti",
          "Translation_Bryant": "When the purity of the intellect is equal to that of the puruṣa, kaivalya liberation ensues."
        }
      },
      {
        "data": {
          "id": "IV.1",
          "label": "janmauṣadhi-mantra-tapaḥ-samādhi-jāḥ siddhayaḥ",
          "Translation_Bryant": "The mystic powers arise due to birth, herbs, mantras, the performance of austerity, and samādhi."
        }
      },
      {
        "data": {
          "id": "IV.2",
          "label": "jāty-antara-pariṇāmaḥ prakṛtyāpūrāt",
          "Translation_Bryant": "The changes [in bodily forms that take place] in other births are due to the filling in by prakṛti."
        }
      },
      {
        "data": {
          "id": "IV.3",
          "label": "nimittam aprayojakaṁ prakṛtīnāṁ varaṇa-bhedas tu tataḥ kṣetrikavat",
          "Translation_Bryant": "The instrumental cause of creation is not its creative cause, but it pierces the covering from creation like a farmer [pierces the barriers between his fields]."
        }
      },
      {
        "data": {
          "id": "IV.4",
          "label": "nirmāṇa-cittāny asmitā-mātrāt",
          "Translation_Bryant": "Created minds are made from ego only."
        }
      },
      {
        "data": {
          "id": "IV.5",
          "label": "pravṛtti-bhede prayojakaṁ cittam ekam anekeṣām",
          "Translation_Bryant": "There is one mind, among the many [created by the yogī], which is the director in the different activities [of the different bodies]."
        }
      },
      {
        "data": {
          "id": "IV.6",
          "label": "tatra dhyāna-jam anāśayam",
          "Translation_Bryant": "From these [five types of minds that possess siddhis], the one born of meditation is without the storehouse of karma."
        }
      },
      {
        "data": {
          "id": "IV.7",
          "label": "karmāśuklākṛṣṇaṁ yoginas tri-vidham itareṣām",
          "Translation_Bryant": "The karma of a yogī is neither white nor black; of everyone else, it is of three types."
        }
      },
      {
        "data": {
          "id": "IV.8",
          "label": "tatas tad-vipākānuguṇānām evābhivyaktir vāsanānām",
          "Translation_Bryant": "From [these three types of karma] the activation of only those subliminal impressions that are ready for fruition [in the next life] occurs."
        }
      },
      {
        "data": {
          "id": "IV.9",
          "label": "jāti-deśa-kāla-vyavahitānām apy ānantaryaṁ smrti-saṁskārayor eka-rūpatvāt",
          "Translation_Bryant": "Because they are identical, there is an uninterrupted connection between memory and saṁskāra, even though they might be separated by birth, time, and place."
        }
      },
      {
        "data": {
          "id": "IV.10",
          "label": "tāsām anāditvaṁ cāśiso nityatvāt",
          "Translation_Bryant": "The saṁskāras are eternal, because the desire [for life] is eternal."
        }
      },
      {
        "data": {
          "id": "IV.11",
          "label": "hetu-phalāśrayālambanaiḥ saṅgṛhītatvād eṣām abhāve tad-abhāvaḥ",
          "Translation_Bryant": "Since [saṁskāras] are held together by immediate cause, motive, the mind, and the object of awareness, the saṁskāras cease when the latter cease."
        }
      },
      {
        "data": {
          "id": "IV.12",
          "label": "atītānāgataṁ svarūpato ‘sty adhva-bhedād dharmāṇām",
          "Translation_Bryant": "The past and the future exist in reality, since they differ [from the present only] in terms of the time of [manifestation] of their characteristics."
        }
      },
      {
        "data": {
          "id": "IV.13",
          "label": "te vyakta-sūkṣmā guṇātmānaḥ",
          "Translation_Bryant": "The past, present, and future have the guṇas as their essence and are either manifest or latent."
        }
      },
      {
        "data": {
          "id": "IV.14",
          "label": "pariṇāmaikatvād vastu-tattvam",
          "Translation_Bryant": "The things [of the world] are objectively real, due to the uniformity [of the guṇas that underpin] all change."
        }
      },
      {
        "data": {
          "id": "IV.15",
          "label": "vastu-sāmye citta-bhedāt tayor vibhaktaḥ panthāḥ",
          "Translation_Bryant": "Because there is a multiplicity of minds [perceiving an object] but yet the object remains consistent, there is a difference in nature between the object and the mind [of the observer]."
        }
      },
      {
        "data": {
          "id": "IV.16",
          "label": "na caika-citta-tantraṁ vastu tad apramāṇakaṁ tadā kiṁ syāt",
          "Translation_Bryant": "An object is not dependent on a single mind [for its existence]; if it were, then what happens to it when it is not perceived [by that particular mind]?"
        }
      },
      {
        "data": {
          "id": "IV.17",
          "label": "tad-uparāgāpekṣitvāc cittasya vastu jñātājñātam",
          "Translation_Bryant": "A thing is either known or not known by the mind depending on whether it is noticed by the mind."
        }
      },
      {
        "data": {
          "id": "IV.18",
          "label": "sadā jñātāś citta-vṛttayas tat-prabhoḥ puruṣasyāpariṇāmitvāt",
          "Translation_Bryant": "The permutations of the mind are always known to its Lord, the puruṣa soul, because of the soul’s unchanging nature."
        }
      },
      {
        "data": {
          "id": "IV.19",
          "label": "na tat-svābhāsaṁ dṛśyatvāt",
          "Translation_Bryant": "Nor is the mind self-illuminating, because of its nature as the object of perception."
        }
      },
      {
        "data": {
          "id": "IV.20",
          "label": "eka-samaye cobhayānavadhāraṇam",
          "Translation_Bryant": "There cannot be discernment of both [the mind and the object it perceives] at the same time."
        }
      },
      {
        "data": {
          "id": "IV.21",
          "label": "cittāntara-dṛśye buddhi-buddher atiprasaṅgaḥ smṛti-saṅkaraś ca",
          "Translation_Bryant": "If [the mind] were cognized by another mind, then there would be an infinite regress of one intelligence [being known] by another intelligence. Moreover, there would also be confusion of memory."
        }
      },
      {
        "data": {
          "id": "IV.22",
          "label": "citer apratisaṅkramāyās tad-ākārāpattau svabuddhi-saṁvedanam",
          "Translation_Bryant": "Although it is unchanging, consciousness becomes aware of its own intelligence by means of pervading the forms assumed by the intelligence."
        }
      },
      {
        "data": {
          "id": "IV.23",
          "label": "draṣṭṛ-dṛśyoparaktaṁ cittaṁ sarvārtham",
          "Translation_Bryant": "The mind, colored by the seer as well as by that which is seen, knows all objects."
        }
      },
      {
        "data": {
          "id": "IV.24",
          "label": "tad-asaṅkhyeya-vāsanā-citram api parārthaṁ saṁhatya-kāritvāt",
          "Translation_Bryant": "That mind, with its countless variegated subliminal impressions, exists for another entity [other than itself], because it operates in conjunction [with other instruments]."
        }
      },
      {
        "data": {
          "id": "IV.25",
          "label": "viśeṣa-darśina ātma-bhāva-bhāvanā-vinivṛttiḥ",
          "Translation_Bryant": "For one who sees the distinction [between the mind and the soul], reflecting on the nature of the self ceases."
        }
      },
      {
        "data": {
          "id": "IV.26",
          "label": "tadā viveka-nimnaṁ kaivalya-prāgbhāraṁ cittām",
          "Translation_Bryant": "At that point, the mind, inclined toward discrimination, gravitates toward ultimate liberation."
        }
      },
      {
        "data": {
          "id": "IV.27",
          "label": "tac-chidreṣu pratyayāntarāṇi saṁskārebhyaḥ",
          "Translation_Bryant": "During the intervals [in this state of discriminate awareness] other ideas [arise] because of previous saṁskāras."
        }
      },
      {
        "data": {
          "id": "IV.28",
          "label": "hānam eṣāṁ kleśavad uktam",
          "Translation_Bryant": "The removal [of these previous saṁskāras] is said to be like [the removal] of the kleśa afflictions."
        }
      },
      {
        "data": {
          "id": "IV.29",
          "label": "prasaṅkhyāne ‘py akusīdasya sarvathā viveka-khyāter dharma-meghaḥ samādhiḥ",
          "Translation_Bryant": "For one who has no interest even in [the fruits] of meditative wisdom on account of the highest degree of discriminative insight, the samādhi called dharma-megha, cloud of virtue, ensues."
        }
      },
      {
        "data": {
          "id": "IV.30",
          "label": "tataḥ kleśa-karma-nivṛttiḥ",
          "Translation_Bryant": "From this comes the cessation of the kleśas [impediments to yoga] and karma."
        }
      },
      {
        "data": {
          "id": "IV.31",
          "label": "tadā sarvāvaraṇa-malāpetasya jñānasyānantyāj jñeyam alpam",
          "Translation_Bryant": "At this point, because of the unlimited nature of knowledge when all impurities have been removed from it, that which remains to be known is little."
        }
      },
      {
        "data": {
          "id": "IV.32",
          "label": "tataḥ kṛtārthānāṁ pariṇāma-krama-parisamāptir guṇānām",
          "Translation_Bryant": "As a result, there is a cessation of the ongoing permutations of the guṇas, their purpose now fulfilled.",
          "tags": "Sequence"
        }
      },
      {
        "data": {
          "id": "IV.33",
          "label": "kṣaṇa-pratiyogī pariṇāmāparānta-nirgrā hyaḥ kramaḥ",
          "Translation_Bryant": "The progression [of any object through Time] corresponds to a [series of] moments. It is perceivable at the final [moment] of change.",
          "tags": "Sequence"
        }
      },
      {
        "data": {
          "id": "IV.34",
          "label": "puruṣārtha-śūnyānāṁ guṇānāṁ pratiprasavaḥ kaivalyaṁ svarūpa-pratiṣṭhā vā citi-śaktir iti",
          "Translation_Bryant": "Ultimate liberation is when the guṇas, devoid of any purpose for the puruṣa, return to their original [latent] state; in other words, when the power of consciousness is situated in its own essential nature."
        }
      }
    ],
    "edges": [
      {
        "data": {
          "source": "I.1",
          "target": "I.2",
          "id": "169f6755-5a6f-4c2e-ac5e-124649bcb8d7"
        }
      },
      {
        "data": {
          "source": "I.2",
          "target": "I.3",
          "id": "7f6171e1-3c8f-4fb5-828f-0c259ebc6edd"
        }
      },
      {
        "data": {
          "source": "I.3",
          "target": "I.4",
          "id": "52b53d3a-2227-4090-92b5-cea3251dcffc"
        }
      },
      {
        "data": {
          "source": "I.4",
          "target": "I.5",
          "id": "b01d9c20-cad2-496e-9bba-93aa1f85980f"
        }
      },
      {
        "data": {
          "source": "I.5",
          "target": "I.6",
          "id": "0e971a41-c98a-4993-b20e-4be245985d04"
        }
      },
      {
        "data": {
          "source": "I.6",
          "target": "I.7",
          "id": "cfe6da6c-7275-4480-85c9-500db3b9abb6"
        }
      },
      {
        "data": {
          "source": "I.6",
          "target": "I.8",
          "id": "ccd3a7af-324d-41e3-9083-757ae6fb1519"
        }
      },
      {
        "data": {
          "source": "I.6",
          "target": "I.9",
          "id": "172caf48-402a-4ea8-a74d-89b8b4ebbc6f"
        }
      },
      {
        "data": {
          "source": "I.6",
          "target": "I.10",
          "id": "ba131c43-67e5-44a2-81d4-d4f3a8ea9b5a"
        }
      },
      {
        "data": {
          "source": "I.6",
          "target": "I.11",
          "id": "6440d3cc-9248-4509-ac3a-7ce9507ab1e3"
        }
      },
      {
        "data": {
          "source": "I.5",
          "target": "I.12",
          "id": "b2a098cd-5969-4a74-891d-aa3cf981c049"
        }
      },
      {
        "data": {
          "source": "I.12",
          "target": "I.13",
          "id": "df1377a4-2dca-49ba-aab3-203027842061"
        }
      },
      {
        "data": {
          "source": "I.12",
          "target": "I.15",
          "id": "9e3b64b9-e63a-4e65-b909-8e2ba31b97ac"
        }
      },
      {
        "data": {
          "source": "I.15",
          "target": "I.16",
          "id": "769ff2a2-e660-4428-b159-d6a60f633dff"
        }
      },
      {
        "data": {
          "source": "I.13",
          "target": "I.14",
          "id": "8e0922af-911b-46f9-8e95-1c1b2795fcc5"
        }
      },
      {
        "data": {
          "source": "I.3",
          "target": "I.17",
          "id": "7dc21dae-5d96-470c-9244-bced49364e20"
        }
      },
      {
        "data": {
          "source": "I.17",
          "target": "I.18",
          "id": "bfc8b2b6-3077-44b8-94ff-108d8d77f671"
        }
      },
      {
        "data": {
          "source": "I.18",
          "target": "I.19",
          "id": "5508c182-3564-4b2e-91ec-24d4038a3432"
        }
      },
      {
        "data": {
          "source": "I.17",
          "target": "I.19",
          "id": "9bae155b-f6b8-4ccf-913c-7c5d34badfd2"
        }
      },
      {
        "data": {
          "source": "I.18",
          "target": "I.20",
          "id": "5cf7d0f9-6bff-4e23-bfea-8769adf43321"
        }
      },
      {
        "data": {
          "source": "I.19",
          "target": "I.20",
          "id": "23929393-c7b5-4587-8978-eed19468bc59"
        }
      },
      {
        "data": {
          "source": "I.20",
          "target": "I.21",
          "id": "f1b458c6-7a63-46c2-b3f7-a68e5937f874"
        }
      },
      {
        "data": {
          "source": "I.21",
          "target": "I.22",
          "id": "13872086-0380-455f-94d0-b76cf933ad8a"
        }
      },
      {
        "data": {
          "source": "I.17",
          "target": "I.23",
          "id": "016fe8d3-f070-4e8d-84e3-34c9b8088202"
        }
      },
      {
        "data": {
          "source": "I.23",
          "target": "I.24",
          "id": "757f6910-78d9-402c-8b72-2a6393563913"
        }
      },
      {
        "data": {
          "source": "I.24",
          "target": "I.25",
          "id": "2adf87cb-99cf-47f5-af87-fe6d7326bcf7"
        }
      },
      {
        "data": {
          "source": "I.25",
          "target": "I.26",
          "id": "88a46c4b-d913-40ea-aa5a-3390d47b6ca1"
        }
      },
      {
        "data": {
          "source": "I.26",
          "target": "I.28",
          "id": "93561d84-da79-4e13-ac16-6e77560c3dc9"
        }
      },
      {
        "data": {
          "source": "I.23",
          "target": "I.25",
          "id": "a724e583-5476-4b09-b6af-582f8ff03d7d"
        }
      },
      {
        "data": {
          "source": "I.23",
          "target": "I.26",
          "id": "b5fbeaea-f39b-42e4-9e7a-0c48a9839625"
        }
      },
      {
        "data": {
          "source": "I.24",
          "target": "I.28",
          "id": "b7b02991-1a0e-4398-b838-16f3c3e14f33"
        }
      },
      {
        "data": {
          "source": "I.25",
          "target": "I.28",
          "id": "85ec5631-b0ae-471f-924f-cd4951714db2"
        }
      },
      {
        "data": {
          "source": "I.28",
          "target": "I.27",
          "id": "a3b567f7-38a7-4346-a1a1-8d3c27a41aa9"
        }
      },
      {
        "data": {
          "source": "I.17",
          "target": "I.29",
          "id": "40897611-9477-423c-aff3-f8a3f34496a3"
        }
      },
      {
        "data": {
          "source": "I.29",
          "target": "I.30",
          "id": "0d09f349-5737-4c87-ba15-8523a1b14692"
        }
      },
      {
        "data": {
          "source": "I.30",
          "target": "I.31",
          "id": "4d697da2-3b72-472e-a6d2-1a7991295651"
        }
      },
      {
        "data": {
          "source": "I.30",
          "target": "I.32",
          "id": "8929d135-5ac7-496a-879f-99c872818958"
        }
      },
      {
        "data": {
          "source": "I.23",
          "target": "I.27",
          "id": "bb487693-a62f-4ca0-87b5-52b48b1178ff"
        }
      },
      {
        "data": {
          "source": "I.20",
          "target": "I.22",
          "id": "6590b4ea-bc02-4b90-a232-b9e192e46ef6"
        }
      },
      {
        "data": {
          "source": "I.47",
          "target": "I.44",
          "id": "0d7db610-4a1a-48de-b82d-860bbd9aed27"
        }
      },
      {
        "data": {
          "source": "I.30",
          "target": "I.33",
          "id": "d34e42e3-0715-4f2d-8e5a-09d2a4b28649"
        }
      },
      {
        "data": {
          "source": "I.48",
          "target": "I.47",
          "id": "2cae0b60-5015-4b0e-b82f-72e4e550d8e2"
        }
      },
      {
        "data": {
          "source": "I.33",
          "target": "I.38",
          "id": "c36c6b72-5c33-43e8-8b62-b73d561fec26"
        }
      },
      {
        "data": {
          "source": "I.49",
          "target": "I.48",
          "id": "cf4cc52c-0e6e-4c83-bc91-e9403cb5de9d"
        }
      },
      {
        "data": {
          "source": "I.17",
          "target": "I.41",
          "id": "2780af67-c22c-4b8e-b3aa-b59c8894913a"
        }
      },
      {
        "data": {
          "source": "I.41",
          "target": "I.42",
          "id": "c11705e4-cbff-432c-a280-3e4201f2a8ce"
        }
      },
      {
        "data": {
          "source": "I.41",
          "target": "I.43",
          "id": "d722662b-c1a2-4b20-974d-e376ad42088a"
        }
      },
      {
        "data": {
          "source": "I.41",
          "target": "I.44",
          "id": "15049bfc-2f59-4ba7-8ac0-c1c8209d814c"
        }
      },
      {
        "data": {
          "source": "I.39",
          "target": "I.40",
          "id": "2888968c-dcb4-4488-8899-9db8350df9ee"
        }
      },
      {
        "data": {
          "source": "I.44",
          "target": "I.45",
          "id": "065af23a-d362-4529-9229-769d68a5fb46"
        }
      },
      {
        "data": {
          "source": "I.44",
          "target": "I.46",
          "id": "f568dc6a-a18b-4eaa-9417-7c67ddad8a76"
        }
      },
      {
        "data": {
          "source": "I.43",
          "target": "I.46",
          "id": "dd42c843-7463-4b1a-a465-1987876d7aa8"
        }
      },
      {
        "data": {
          "source": "I.42",
          "target": "I.46",
          "id": "f4441133-9fdb-45c3-906f-97790908ba18"
        }
      },
      {
        "data": {
          "source": "I.46",
          "target": "I.17",
          "id": "702655be-9030-4e01-982f-d7e0d2618ab6"
        }
      },
      {
        "data": {
          "source": "I.45",
          "target": "I.40",
          "id": "40538a56-0c8f-4cbb-a83b-cc2cc37b6638"
        }
      },
      {
        "data": {
          "source": "I.51",
          "target": "I.50",
          "id": "6c3af9e8-0b89-4cec-b762-3b362f42381d"
        }
      },
      {
        "data": {
          "source": "I.26",
          "target": "I.27",
          "id": "55546442-4395-4c90-85e2-438278dd4093"
        }
      },
      {
        "data": {
          "source": "I.33",
          "target": "I.39",
          "id": "245f121b-be49-4c42-adda-093e56b3cc02"
        }
      },
      {
        "data": {
          "source": "I.33",
          "target": "I.34",
          "id": "8feee38f-5114-4542-acc6-62af81f54ea4"
        }
      },
      {
        "data": {
          "source": "I.33",
          "target": "I.35",
          "id": "223c97b2-72ff-437b-b5ca-b2e9da9e2810"
        }
      },
      {
        "data": {
          "source": "I.33",
          "target": "I.36",
          "id": "b340ff9d-0eaf-4a70-9ab7-ca3694c8078d"
        }
      },
      {
        "data": {
          "source": "I.33",
          "target": "I.37",
          "id": "e84edff0-40f3-4ed6-b972-0aaba0029c40"
        }
      },
      {
        "data": {
          "source": "I.49",
          "target": "I.50",
          "id": "a2a67df1-c26d-408c-ad62-fd9d64180473"
        }
      },
      {
        "data": {
          "source": "I.47",
          "target": "I.49",
          "id": "33a43439-4d69-4677-a7f0-2e7aa21611e0"
        }
      },
      {
        "data": {
          "source": "I.47",
          "target": "I.50",
          "id": "9dd708b5-7b5c-4a42-a04f-5941707bef0d"
        }
      },
      {
        "data": {
          "source": "I.2",
          "target": "I.4",
          "id": "89e2e13f-edf8-40bb-bd2d-cca54c8beead"
        }
      }
    ]
  },
  "positions": {
    "I.1": {
      "x": -903.396096734982,
      "y": -229.0636223212696
    },
    "I.2": {
      "x": -651.4274430237048,
      "y": -228.06613827219658
    },
    "I.3": {
      "x": -453.9656900648132,
      "y": -329.12149453498296
    },
    "I.4": {
      "x": -453.09260732319115,
      "y": -141.02515857066032
    },
    "I.5": {
      "x": -97.25782710715058,
      "y": -156.42753327481668
    },
    "I.6": {
      "x": 186.19027603090854,
      "y": -153.46816325037474
    },
    "I.7": {
      "x": 491.21646040440095,
      "y": -387.14014148379664
    },
    "I.8": {
      "x": 495.35427055928886,
      "y": -286.0571428725321
    },
    "I.9": {
      "x": 494.6449011994348,
      "y": -180.0775688406014
    },
    "I.10": {
      "x": 491.1784326928857,
      "y": -71.03709829355842
    },
    "I.11": {
      "x": 492.5762690105692,
      "y": 44.201667650405014
    },
    "I.12": {
      "x": -449.3314419532057,
      "y": 208.7833305342663
    },
    "I.13": {
      "x": -92.31803202883573,
      "y": 99.31418099209394
    },
    "I.14": {
      "x": 236.88487114502118,
      "y": 103.7136212177284
    },
    "I.15": {
      "x": -89.9737492267907,
      "y": 243.59139987730256
    },
    "I.16": {
      "x": 226.849169536016,
      "y": 250.46003721896864
    },
    "I.17": {
      "x": -453.87516455818167,
      "y": 677.8249297893498
    },
    "I.18": {
      "x": -86.82489559715705,
      "y": 431.9627611411401
    },
    "I.19": {
      "x": -93.42966447846909,
      "y": 590.4340992805576
    },
    "I.20": {
      "x": 218.66819990002807,
      "y": 482.99392388144304
    },
    "I.21": {
      "x": 503.2362066043687,
      "y": 379.8236084286643
    },
    "I.22": {
      "x": 502.55813129069367,
      "y": 573.4550814349038
    },
    "I.23": {
      "x": -93.70361362752945,
      "y": 810.5312014365891
    },
    "I.24": {
      "x": 240.05074110163025,
      "y": 648.0505961510277
    },
    "I.25": {
      "x": 234.65087474210375,
      "y": 779.4437913785719
    },
    "I.26": {
      "x": 228.4149428263883,
      "y": 907.7907438453615
    },
    "I.27": {
      "x": 232.36426992642475,
      "y": 1024.796605768216
    },
    "I.28": {
      "x": 524.1158529075215,
      "y": 822.9982662265139
    },
    "I.29": {
      "x": -451.0354876980863,
      "y": 1209.963314777006
    },
    "I.30": {
      "x": 231.6673794734162,
      "y": 1236.507426603176
    },
    "I.31": {
      "x": 731.2188540666401,
      "y": 987.2341945938896
    },
    "I.32": {
      "x": 740.1779806239308,
      "y": 1180.9610563912763
    },
    "I.33": {
      "x": 742.3784263956696,
      "y": 1384.1197980752897
    },
    "I.34": {
      "x": 1193.8311011574563,
      "y": 996.0679563048571
    },
    "I.35": {
      "x": 1182.6828011987177,
      "y": 1123.5705318267012
    },
    "I.36": {
      "x": 1191.1852013714185,
      "y": 1246.5557571864383
    },
    "I.37": {
      "x": 1193.1711665278415,
      "y": 1359.7210547538473
    },
    "I.38": {
      "x": 1201.9500106485002,
      "y": 1488.40491095071
    },
    "I.39": {
      "x": 1198.0069939824173,
      "y": 1632.1063572827566
    },
    "I.40": {
      "x": 604.6121413857073,
      "y": 1683.5349520599648
    },
    "I.41": {
      "x": -449.6138587139555,
      "y": 1923.2636138494252
    },
    "I.42": {
      "x": -110.04241597626124,
      "y": 1730.571326511007
    },
    "I.43": {
      "x": -104.59526516327894,
      "y": 1935.104964565308
    },
    "I.44": {
      "x": -133.12101029676344,
      "y": 2311.166899395253
    },
    "I.45": {
      "x": 217.3565979676373,
      "y": 1807.116439177424
    },
    "I.46": {
      "x": 225.03702448621596,
      "y": 1957.6222239603358
    },
    "I.47": {
      "x": 228.84708660694102,
      "y": 2132.3941187269543
    },
    "I.48": {
      "x": 630.7484234512528,
      "y": 2006.9732854687584
    },
    "I.49": {
      "x": 634.9967657904391,
      "y": 2119.1572731428796
    },
    "I.50": {
      "x": 635.8965724090998,
      "y": 2247.6976865323422
    },
    "I.51": {
      "x": 1494.1384407992769,
      "y": 2252.9860332124954
    },
    "II.1": {
      "x": 1799.6679383392757,
      "y": 974.2806288417759
    },
    "II.2": {
      "x": 2078.124126349045,
      "y": 973.6738133617481
    },
    "II.3": {
      "x": 2349.4258130085605,
      "y": 971.7674990283897
    },
    "II.4": {
      "x": 2659.538991456595,
      "y": 629.535786791348
    },
    "II.5": {
      "x": 2909.7850939758873,
      "y": 628.6620181681387
    },
    "II.6": {
      "x": 2656.434781573954,
      "y": 798.91955525406
    },
    "II.7": {
      "x": 2658.5518343718127,
      "y": 936.6079703763352
    },
    "II.8": {
      "x": 2651.866785119272,
      "y": 1049.424327298465
    },
    "II.9": {
      "x": 2663.038272228094,
      "y": 1178.3368824162806
    },
    "II.10": {
      "x": 2660.5468972968547,
      "y": 1399.7316488377135
    },
    "II.11": {
      "x": 2903.6515484929155,
      "y": 1325.6438121479018
    },
    "II.12": {
      "x": 2906.655214205095,
      "y": 1531.2857478944654
    },
    "II.13": {
      "x": 3125.6438412190587,
      "y": 1323.7452227262513
    },
    "II.14": {
      "x": 3137.8844505522347,
      "y": 1531.8739641691254
    },
    "II.15": {
      "x": 2346.9776741137634,
      "y": 1910.918300501334
    },
    "II.16": {
      "x": 2632.6872511078095,
      "y": 1779.9979926138344
    },
    "II.17": {
      "x": 2642.8680064070572,
      "y": 2007.3427062823707
    },
    "II.18": {
      "x": 2949.824865763611,
      "y": 1881.7831941100278
    },
    "II.19": {
      "x": 3277.459282682627,
      "y": 1844.4803600522841
    },
    "II.20": {
      "x": 2948.5630793696264,
      "y": 2107.187892266742
    },
    "II.21": {
      "x": 2960.127313146332,
      "y": 2296.0173946746313
    },
    "II.22": {
      "x": 3310.4919421713016,
      "y": 2172.345409853345
    },
    "II.23": {
      "x": 3316.5725040131492,
      "y": 2377.883235119759
    },
    "II.24": {
      "x": 2893.9408258577887,
      "y": 2711.2384365581743
    },
    "II.25": {
      "x": 3274.2684974545,
      "y": 2689.3396956271417
    },
    "II.26": {
      "x": 3570.550610999257,
      "y": 2602.9599204184597
    },
    "II.27": {
      "x": 3579.6929969560238,
      "y": 2732.25402083252
    },
    "II.28": {
      "x": 3599.2209114638267,
      "y": 2894.046451303846
    },
    "II.29": {
      "x": 3987.8780741017363,
      "y": 2893.4555442769656
    },
    "II.30": {
      "x": 4471.501178807764,
      "y": 948.3550534696601
    },
    "II.31": {
      "x": 4794.646733299333,
      "y": 665.3018484285457
    },
    "II.32": {
      "x": 4472.935644184991,
      "y": 2287.024041927787
    },
    "II.33": {
      "x": 4824.510086452035,
      "y": 1652.3210444271006
    },
    "II.34": {
      "x": 5028.067640778731,
      "y": 1653.9956346246813
    },
    "II.35": {
      "x": 4791.832810885168,
      "y": 828.6513184974781
    },
    "II.36": {
      "x": 4810.980984341265,
      "y": 971.9395271241714
    },
    "II.37": {
      "x": 4820.381104187405,
      "y": 1090.3507228820988
    },
    "II.38": {
      "x": 4789.828276610721,
      "y": 1211.909712895551
    },
    "II.39": {
      "x": 4806.329431513485,
      "y": 1371.4595360914136
    },
    "II.40": {
      "x": 4793.7076014431605,
      "y": 1977.1036479000593
    },
    "II.41": {
      "x": 5089.402383921869,
      "y": 1982.4914768708554
    },
    "II.42": {
      "x": 4762.9327833037705,
      "y": 2118.6182880831157
    },
    "II.43": {
      "x": 4777.240713717358,
      "y": 2243.9844079961185
    },
    "II.44": {
      "x": 4776.727277021472,
      "y": 2386.920948113961
    },
    "II.45": {
      "x": 4774.169854698864,
      "y": 2514.2954355815978
    },
    "II.46": {
      "x": 4415.117102658262,
      "y": 2836.0220677467064
    },
    "II.47": {
      "x": 4765.828968205246,
      "y": 2744.7634146983887
    },
    "II.48": {
      "x": 4731.676927467408,
      "y": 2872.630503496668
    },
    "II.49": {
      "x": 4419.445214811804,
      "y": 3222.648712277063
    },
    "II.50": {
      "x": 4722.202613032593,
      "y": 3114.701843234753
    },
    "II.51": {
      "x": 4726.958690200977,
      "y": 3317.0748890217656
    },
    "II.52": {
      "x": 5025.924589339553,
      "y": 3214.984139124475
    },
    "II.53": {
      "x": 5026.788149820868,
      "y": 3372.9753281417757
    },
    "II.54": {
      "x": 4435.810873843977,
      "y": 3576.8306439296275
    },
    "II.55": {
      "x": 4724.832007427765,
      "y": 3568.4764698186414
    },
    "III.1": {
      "x": 4446.046148867237,
      "y": 3873.4942652894097
    },
    "III.2": {
      "x": 4441.927547150135,
      "y": 4134.962988567603
    },
    "III.3": {
      "x": 4450.856729357997,
      "y": 4356.285219110512
    },
    "III.4": {
      "x": 4714.605099394764,
      "y": 3860.650139221929
    },
    "III.5": {
      "x": 5006.623060909701,
      "y": 3784.220940102851
    },
    "III.6": {
      "x": 5012.1171579184,
      "y": 3914.459285542115
    },
    "III.7": {
      "x": 4714.155521802561,
      "y": 4135.025372567331
    },
    "III.8": {
      "x": 5000.244911796956,
      "y": 4128.748749790995
    },
    "III.9": {
      "x": 5319.446058870475,
      "y": 4118.301342913492
    },
    "III.10": {
      "x": 5631.373986345217,
      "y": 3937.4273763521087
    },
    "III.11": {
      "x": 5626.90336184591,
      "y": 4117.009017020059
    },
    "III.12": {
      "x": 5636.018208020134,
      "y": 4323.222104008433
    },
    "III.13": {
      "x": 5982.494413281473,
      "y": 4229.7496847375905
    },
    "III.14": {
      "x": 6300.082122823956,
      "y": 4209.134115382584
    },
    "III.15": {
      "x": 6285.5212090048435,
      "y": 4372.054063200516
    },
    "III.16": {
      "x": 6281.6827486409165,
      "y": 4557.5339612913085
    },
    "III.17": {
      "x": 6561.9026397469715,
      "y": 4182.643257425998
    },
    "III.18": {
      "x": 6588.878945564163,
      "y": 4467.411092926692
    },
    "III.19": {
      "x": 6596.098967133333,
      "y": 4621.2939047125965
    },
    "III.20": {
      "x": 6861.136544173961,
      "y": 4495.488504608706
    },
    "III.21": {
      "x": 6872.699773288564,
      "y": 4689.093534024639
    },
    "III.22": {
      "x": 6874.799879213805,
      "y": 4881.969112094823
    },
    "III.23": {
      "x": 6482.128995739665,
      "y": 5298.7222438760955
    },
    "III.24": {
      "x": 6679.611305248665,
      "y": 5296.884561709714
    },
    "III.25": {
      "x": 6887.88367017316,
      "y": 5298.385180934613
    },
    "III.26": {
      "x": 7163.99522427318,
      "y": 4966.627823574245
    },
    "III.27": {
      "x": 7160.562473794894,
      "y": 5090.837656080696
    },
    "III.28": {
      "x": 7161.39216588594,
      "y": 5205.783785118967
    },
    "III.29": {
      "x": 7159.763283312597,
      "y": 5328.910343705846
    },
    "III.30": {
      "x": 7158.544254258804,
      "y": 5456.984978742501
    },
    "III.31": {
      "x": 7157.064151656807,
      "y": 5572.72138192709
    },
    "III.32": {
      "x": 7160.499416690717,
      "y": 5692.241908863244
    },
    "III.33": {
      "x": 6893.009343072734,
      "y": 6015.49544388072
    },
    "III.34": {
      "x": 7168.672540628152,
      "y": 6013.931978617545
    },
    "III.35": {
      "x": 6871.866769983872,
      "y": 6321.023819450923
    },
    "III.36": {
      "x": 7167.971753754971,
      "y": 6273.883258886467
    },
    "III.37": {
      "x": 7480.115067357358,
      "y": 6260.964776200655
    },
    "III.38": {
      "x": 7716.672639006372,
      "y": 5961.694584530352
    },
    "III.39": {
      "x": 7713.68368678708,
      "y": 6129.7432796798985
    },
    "III.40": {
      "x": 7712.566504146128,
      "y": 6268.753951152896
    },
    "III.41": {
      "x": 7708.655605799243,
      "y": 6399.674525299182
    },
    "III.42": {
      "x": 7717.182726105332,
      "y": 6588.4732368304285
    },
    "III.43": {
      "x": 7719.382470986714,
      "y": 6796.979745075017
    },
    "III.44": {
      "x": 7763.559161791377,
      "y": 6975.515743258828
    },
    "III.45": {
      "x": 8090.033937639734,
      "y": 6310.142077275257
    },
    "III.46": {
      "x": 8356.549381145038,
      "y": 6145.308168053011
    },
    "III.47": {
      "x": 8421.7925146846,
      "y": 6330.5450572566115
    },
    "III.48": {
      "x": 8366.476226822599,
      "y": 6517.413633196846
    },
    "III.49": {
      "x": 6723.186830004142,
      "y": 7463.979035291122
    },
    "III.50": {
      "x": 7004.05281746044,
      "y": 7270.077340447085
    },
    "III.51": {
      "x": 6995.551762528652,
      "y": 7448.112821973866
    },
    "III.52": {
      "x": 6996.38592632882,
      "y": 7658.061265571172
    },
    "III.53": {
      "x": 7227.81635190742,
      "y": 7621.156817175159
    },
    "III.54": {
      "x": 7231.850049370521,
      "y": 7818.878469540669
    },
    "III.55": {
      "x": 8153.4255495489515,
      "y": 7256.264176051675
    },
    "IV.1": {
      "x": -703.385951625683,
      "y": 3584.698649907294
    },
    "IV.2": {
      "x": -410.14166380170127,
      "y": 3469.3093068778285
    },
    "IV.3": {
      "x": -407.9329534385886,
      "y": 3674.3096631357716
    },
    "IV.4": {
      "x": -198.9129905312185,
      "y": 3567.9320218069743
    },
    "IV.5": {
      "x": -1.812161500245188,
      "y": 3442.1433376272366
    },
    "IV.6": {
      "x": -3.7125519196737713,
      "y": 3712.7905085768225
    },
    "IV.7": {
      "x": 270.08506496631213,
      "y": 3700.1605334210653
    },
    "IV.8": {
      "x": 551.5659220062773,
      "y": 3692.8905255428463
    },
    "IV.9": {
      "x": 810.3913740847477,
      "y": 3543.413949594595
    },
    "IV.10": {
      "x": 822.2899384441027,
      "y": 3730.6250005107418
    },
    "IV.11": {
      "x": 819.0633983430987,
      "y": 3890.3172245541405
    },
    "IV.12": {
      "x": 1108.729436318685,
      "y": 3401.327349692239
    },
    "IV.13": {
      "x": 1103.325761333095,
      "y": 3585.8551393842495
    },
    "IV.14": {
      "x": 1104.8758088408183,
      "y": 3746.6343431650057
    },
    "IV.15": {
      "x": -0.29247259814254534,
      "y": 4270.463859112967
    },
    "IV.16": {
      "x": 260.6232566782904,
      "y": 4047.1846157997916
    },
    "IV.17": {
      "x": 265.39800034896484,
      "y": 4208.363348816771
    },
    "IV.18": {
      "x": 267.8087241741793,
      "y": 4360.8538637798565
    },
    "IV.19": {
      "x": 557.374996881994,
      "y": 4232.206231623062
    },
    "IV.20": {
      "x": 566.6234491150744,
      "y": 4364.850111504972
    },
    "IV.21": {
      "x": 576.4703478370074,
      "y": 4531.970562703487
    },
    "IV.22": {
      "x": 933.0210380560602,
      "y": 4373.103958419068
    },
    "IV.23": {
      "x": 951.119229241283,
      "y": 4532.916527156438
    },
    "IV.24": {
      "x": 965.1618050288738,
      "y": 4703.966176799897
    },
    "IV.25": {
      "x": 969.4001744699974,
      "y": 4881.246626132281
    },
    "IV.26": {
      "x": 1269.161498715456,
      "y": 4851.020262120533
    },
    "IV.27": {
      "x": 1265.600579063137,
      "y": 5033.858593855562
    },
    "IV.28": {
      "x": 1524.6326512174385,
      "y": 5043.503592457524
    },
    "IV.29": {
      "x": 1530.0544390004798,
      "y": 5242.620192782725
    },
    "IV.30": {
      "x": 1786.6575080869663,
      "y": 5136.752527982913
    },
    "IV.31": {
      "x": 1787.370564180774,
      "y": 5307.350337135372
    },
    "IV.32": {
      "x": 2061.6848835036794,
      "y": 5147.583683003791
    },
    "IV.33": {
      "x": 2298.8708399826583,
      "y": 5145.812754385095
    },
    "IV.34": {
      "x": 2775.516164097897,
      "y": 5140.308264338424
    }
  }
}
